# flowchart - ეს არის ერთგვარი გრაფა, როდესაც კოდი გარკვეულ თანმიმდევრობას მიჰყვება, რომელიც თუ დაირღვევა, კოდი არასწორი იქნება
# sequencing - არის იგივე როცა კოდი მიჰყვება ამ გარკვეულ თანმიმდევრობას
# selection - არის გადაწყვეტილების მიღება პირობის მიხედვით — თუ პირობა მართალია, კეთდება ერთი რამ; თუ არა — სხვა.
# iteration - არის, როდესაც კოდი რაღაც მოქმედებას იმეორებს მანამ, სანამ ის არ შესრულდება, რაც საჭიროა
# pseudocode - არის ფსევდოკოდი, რომელიც მიახლოვებულია, როგორც კომპიუტერის ენასთან, ასევე ინგლისურთან...მარტივად არის გამარტივებული პროგრამირების ენა
# natural language - არის ტექსტი, რომელიც ჩვეულებრივი სასაუბრო ენაა და ხსნის რას აკეთებს კოდი

print("ვიღებთ რამდენიმე კვერცს(რაოდენობა ჩვენზეა დამოკიდებული)")
print("შემდეგ ვტეხთ და შინაგან ნაწილს ერთ თეფშში ვათავსებთ და კარგად ავთქლიფავთ")
print("ამის მერე, ამ თეფშში ვდებთ პურს და კარგად ვურევთ")
print("შემდეგ ვამატებთ ოდნავ მარილს გემოვნებით")
print("ტაფაში ვასხამთ ზეთს და ვდებთ პურსაც")
print("ველოდებით 10-15 წუთი და ვიღებთ ჩვენს არაჩვეულებრივ კვერცხიან პურს")
print("ახლაკი შეგიძლიათ დატკბეთ თქვენი კვარციანი პურებით(მაგრამ იცოდე რომ ბებოს კვარცხიან პურს ვერ აჯობებ და ტყუილად არ ეცადო)")