# flowchart - ეს არის ერთგვარი გრაფა, როდესაც კოდი გარკვეულ თანმიმდევრობას მიჰყვება, რომელიც თუ დაირღვევა, კოდი არასწორი იქნება
# sequencing - არის იგივე როცა კოდი მიჰყვება ამ გარკვეულ თანმიმდევრობას
# selection - არის გადაწყვეტილების მიღება პირობის მიხედვით — თუ პირობა მართალია, კეთდება ერთი რამ; თუ არა — სხვა.
# iteration - არის, როდესაც კოდი რაღაც მოქმედებას იმეორებს მანამ, სანამ ის არ შესრულდება, რაც საჭიროა

#ტემპერატურა ფარენჰეიტიდან ცელსიუსში
F1 = int(input("Temperature in Fahrenheit:"))
C1 = (F1 - 32) * 5/9
print(C1)

#ტემპერატურა ცელსიუსიდან ფარენჰეიტში
C2 = int(input("Temperature in celsius"))
F2 = (C2 * 9/5) + 32
print(F2)