#print --> ფუნქცია, რომლის დახმარებითაც გამოგვაქვს გარკვეული მნიშვნელობა, რომელიც, შეიძლება იყოს ტექსტი, რიცხვი და ა.შ.

#ფუნქცია --> არის ერთგვარი დავალების პირობა, რომელსაც ასრულებს კომპიუტერი

#კომპიუტერი ყველაფერს აღიქვამს 1-ებისა და 0-ების კომბინაციად

#სულ ჩვენ ვიცით 3 ტიპის მონაცემი (ჯერჯერობით!), ესენია: string, intiger და float

#განვიხილოთ თითოეული:
# 1) string --> აირს იგივე ტექსტი რომელიც შეიძლება შედგებოდეს ყველაფრისგან: # რიცხვები, ასოები, სასვენი ნიშნები და ა.შ. როცა მათ წერ, ეს ტექსტი აუცილებლად უნდა ჩაიწეროს პრჭყალებში, მაგ: -- print("აბსფცდწ81273ჰდჯს..ლ;ლ,მ//.[;/.]").

#2) intiger --> ეს იგივეა, რაც მთელი რიცხვები. ყველანაირი მთელი რიცხვი, intiger-იაა და არ სჭირდება არანაირი პრჭყალები, მაგ: print(3.14)

#3) float -- ეს არის ათწილადი რიცხვები, ანუ მთელი და კიდევ რაღაც ნაწილი, მაგ: print(10.4), თუმცა ჩვენ თუ დაგვჭირდება შეგვიძლია მთელი რიცხვების ათწილადად 
# დაწერა, მაგ: print(10.0), რადგან მთელი რიცხვის ნაწილი .0-ია

# #კომენტარი --> არის ტექსტი რომელსაც წინ დასმული აქვს "#" ნიშანი, რაც იმას 
# გამოსახავს, რომ მას კოდი "დააიგნორებს" და ის შექმნილია ადამიანთათვის
# მაგალითად მე ბოლოს გამოვიყენე კომენტარი ადამიანებისათვის რათა გაიგონ თუ
# რას ვაკეთებ

#case_sensitive --> ეს არის იგივე მართლწერის წესი! პითონი, ასე ვთქვათ ძალიან 
#"მგრძნობიარე" ენაა და ამის გამო ყველა პატარა თუ დიდ ასოს ექცევა ყურადღება!

#snake_case --> არის იგივე ქვედატირის გამოყენება! რადგან ცვლადის შექმნის დროს
#არ ვიყენებთ space, ამიტომ რომ განვასხვაოთ სიტყვები ვიყენებთ ქვედა ტირეს და რადგან
#ის "ქვემოთაა", ამიტომ snake_case ეწოდება

#bug --> ზუსტად ითარგმნება როგორც შეცდომა და არის მომენტი როცა კოდში შეცდომაა
#და კოდი არ გაიშვება
#debugging --> არის კოდში დაშვებული შეცდომის გამოსწორება რათა კოდი გაეშვას